tutorials/movingMesh/Allrun
#!/bin/sh                                                                                                                                                                                                                                     
# Source tutorial run functions                                                                                                                                                                                                               
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name                                                                                                                                                                                                                        
application="rhoCentralDyMFoam"


 runApplication blockMesh                                                                                                                                                                                                                    
runApplication paraFoam -touch
runApplication $application 
