tutorials/movingMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            patch;
        physicalType    patch;
        nFaces          162;
        startFace       2680;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          9;
        startFace       2842;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          9;
        startFace       2851;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          9;
        startFace       2860;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          9;
        startFace       2869;
    }
)

// ************************************************************************* //
